import "./contentOne.css";
const ContentOne = () => {
  return (
    <div
      className="text-right"
      data-aos="fade-right">
      <p className="text-gray-800 text-base  md:text-xl leading-relaxed">
        بدأت شباب قادرون كأحد الكيانات الشبابية بوزارة الشباب والرياضة بدعم
        ورعاية من معالى وزير الشباب والرياضة الأستاذ الدكتور / أشرف صبحى. وخلال
        عامان قدمت فعاليات وأنشطة شبابية في مصر وكانت البداية بمؤتمر الشباب
        العربي في ظل الجمهورية الجديدة برعاية سيادتكم، وهي نقطة البداية للتواجد
        عربيًا بعدد من البلدان العربية الشقيقة من خلال المملكة الأردنية الهاشمية
        حيث تلقت شباب قادرون دعوة كريمة من وزارة الشباب والتنمية السياسية ومجلس
        النواب الأردني لنقل تجربة شباب قادرون إلى الأردن الشقيقة مما نتج عن صدى
        تلك الزيارة توجيه الدعوة من السيد رئيس شباب قادرون / وائل محمد الشريف
        بتوجيه الدعوة من الديوان الملكي بالأردن لكوادر شباب قادرون بالأردن وطلب
        العديد من القيادات الشبابية في السعودية والإمارات والكويت والبحرين
        والمغرب لتكرار نفس التجربة الأردنية. ونجحت في بناء شراكات مع مؤسسات
        وشركات عالمية عملاقة مثل (Master card, ALX, One young world, Microsoft
        global). وتطمح شباب قادرون من خلال التواجد العربي والإقليمي إلى:
      </p>
      <ol className="list1 list-decimal list-inside mr-4 space-y-2 pl-5 marker:font-bold marker:text-red-600">
        <li className="text-gray-800 hover:text-red-600 transition-colors">
          سوق عمل جديد للشباب المصري.
        </li>
        <li className="text-gray-800 hover:text-red-600 transition-colors">
          بناء شراكات اقتصادية وتكنولوجية مع الدول العربية.
        </li>
        <li className="text-gray-800 hover:text-red-600 transition-colors">
          تعزيز الدور المصري في تمكين الشباب والمرأة بالوطن العربي خلال الـ 10
          سنوات الأخيرة.
        </li>
      </ol>
    </div>
  );
};

export default ContentOne;
